SetUBC97
Syntax
SapObject.SapModel.LoadPatterns.AutoWind.SetUBC97
VB6 Procedure
Function SetUBC97(ByVal Name As String, ByVal ExposureFrom As Long, ByVal DirAngle As Double, ByVal Cpw As Double, ByVal Cpl As Double, ByVal UserZ As Boolean, ByVal TopZ As Double, ByVal BottomZ As Double, ByVal WindSpeed As Double, ByVal ExposureType As Long, ByVal ImportanceFactor As Double, Optional ByVal UserExposure As Boolean = False) As Long
Parameters
Name
The name of an existing Wind-type load pattern.
ExposureFrom
This is either 1 or 2, indicating the source of the wind exposure.
1 = From extents of rigid diaphragms
2 = From area objects
DirAngle
The direction angle for the wind load. This item applies only when ExposureFrom = 1.
Cpw
The windward coefficient, Cq. This item applies only when ExposureFrom = 1.
Cpl
The leeward coefficient, Cq. This item applies only when ExposureFrom = 1.
UserZ
This item is True if the top and bottom elevations of the wind load are user specified. It is False if the elevations are determined by the program.
TopZ
This item applies only when the UserZ item is True. It is the global Z-coordinate at the highest level where auto wind loads are applied. [L]
BottomZ
This item applies only when the UserZ item is True. It is the global Z-coordinate at the lowest level where auto wind loads are applied. [L]
WindSpeed
The wind speed in miles per hour.
ExposureType
This is 1, 2 or 3, indicating the exposure category.
1 = B
2 = C
3 = D
ImportanceFactor
The importance factor.
UserExposure
If this item is True, the wind exposure widths are provided by the user. If it is False, the wind exposure widths are calculated by the program from the extents of the diaphragms.
Remarks
This function assigns auto wind loading parameters for 1997 UBC.
The function returns zero if the parameters are successfully assigned; otherwise it returns a nonzero value.
VBA Example
Sub AssignWindUBC97()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New3DFrame(BeamSlab, 2, 144, 3, 336, 2, 432)
 'define diaphragm constraints
 ret = SapModel.ConstraintDef.SetDiaphragm("Diaph1", Z)
 ret = SapModel.ConstraintDef.SetDiaphragm("Diaph2", Z)
 'assign points to diaphragm
 ret = SapModel.SelectObj.ClearSelection
 ret = SapModel.SelectObj.PlaneXY("2")
 ret = SapModel.PointObj.SetConstraint("", "Diaph1", SelectedObjects)
 ret = SapModel.SelectObj.ClearSelection
 ret = SapModel.SelectObj.PlaneXY("3")
 ret = SapModel.PointObj.SetConstraint("", "Diaph2", SelectedObjects)
 ret = SapModel.SelectObj.ClearSelection
 'add new load pattern
 ret = SapModel.LoadPatterns.Add("WIND", LTYPE_WIND)
 'assign UBC97 parameters
 ret = SapModel.LoadPatterns.AutoWind.SetUBC97("WIND", 1, 0, 0.8, 0.5, False, 0, 0, 80, 3, 1.15)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.01.
Changed nomenclature from Load Cases, Analysis Cases and Response Combinations to Load Patterns, Load Cases and Load Combinations, respectively, in version 12.00.
See Also
GetUBC97